exports.up = async (pgm) => {
  pgm.sql(`
    INSERT INTO staff_master (id, display_name_kanji, display_name_kana, email, created_by, created_at, updated_at)
    VALUES
      ('e2a3ee29-fa62-4394-b5c5-4826f30cde30', '有澤　知子', 'アリサワ　トモコ', NULL, 'admin-manual-import', '2026-02-16 10:18:56.952141', '2026-02-16 10:18:56.952141'),
      ('49972e7a-f311-4358-86cb-2b5c34081b69', '井上　誠司', 'イノウエ　セイジ', NULL, 'admin-manual-import', '2026-02-16 10:18:59.795961', '2026-02-16 10:18:59.795961'),
      ('433360cd-5de2-4402-83a4-1c0abb2f1626', '井村　義則', 'イムラ　ヨシノリ', NULL, 'admin-manual-import', '2026-02-16 10:18:58.378965', '2026-02-16 10:18:58.378965'),
      ('2018528a-1287-4df3-9401-14b88fceaf6d', 'イ　モン　チョー', 'イ　モン　チョー', NULL, 'admin-manual-import', '2026-02-16 10:18:56.493361', '2026-02-16 10:18:56.493361'),
      ('5cdb75da-9c58-4dbf-9deb-195afdc96fd1', '梅原　幸雄', 'ウメハラ　ユキオ', NULL, 'admin-manual-import', '2026-02-16 10:18:54.623989', '2026-02-16 10:18:54.623989'),
      ('0f1514c9-0524-4be6-b725-5161ed6a371f', '大野　祢音', 'オオノ　ナイト', NULL, 'admin-manual-import', '2026-02-16 10:18:56.037351', '2026-02-16 10:18:56.037351'),
      ('578c67f0-88e9-4f2d-93b1-079d977b71ca', '梶原　創', 'カジハラ　ソウ', NULL, 'admin-manual-import', '2026-02-16 10:18:50.921408', '2026-02-16 10:18:50.921408'),
      ('712606ff-a3bd-49ae-a351-9cd10dab8bb5', 'カッサ　ヨハネス　アスゲドム', 'カッサ　ヨハネス　アスゲドム', NULL, 'admin-manual-import', '2026-02-16 10:18:57.429327', '2026-02-16 10:18:57.429327'),
      ('83b466ae-a722-4238-b698-8bc93f99a5f7', '川面　直人', 'カワオモ　ナオト', NULL, 'admin-manual-import', '2026-02-16 10:18:53.216126', '2026-02-16 10:18:53.216126'),
      ('b55cd8f2-2e28-4f84-bb79-084107001b13', '神崎　誠', 'カンザキ　マコト', NULL, 'admin-manual-import', '2026-02-16 10:18:55.568815', '2026-02-16 10:18:55.568815'),
      ('e9bc1be3-8661-4456-ad1e-9618ccf01abf', '岸本　直美', 'キシモト　ナオミ', NULL, 'admin-manual-import', '2026-02-16 10:18:54.157201', '2026-02-16 10:18:54.157201'),
      ('ed998da1-091c-4d1a-94f7-22ed6376beb7', '北口　恵一', 'キタグチ　ケイイチ', NULL, 'admin-manual-import', '2026-02-16 10:18:57.910662', '2026-02-16 10:18:57.910662'),
      ('897b046a-15fc-4865-af3f-f5d2f1d4671d', '京谷　雅弥', 'キョウタニ　マサヤ', NULL, 'admin-manual-import', '2026-02-16 10:18:49.513425', '2026-02-16 10:18:49.513425'),
      ('105b5ece-354d-4376-b56b-d0dbbafcd1e3', '久保　勇太', 'クボユウタ', NULL, 'admin-manual-import', '2026-02-16 10:18:51.838919', '2026-02-16 10:18:51.838919'),
      ('85580fdd-feb4-495b-a2ae-5b7f3928cc96', '近藤　拓翔', 'コンドウ　タクト', NULL, 'admin-manual-import', '2026-02-16 10:18:59.313973', '2026-02-16 10:18:59.313973'),
      ('15dd404b-8f6e-40ca-8f81-cd19549cc78b', '高梨　航希', 'タカナシ　コウキ', NULL, 'admin-manual-import', '2026-02-16 10:18:48.595991', '2026-02-16 10:18:48.595991'),
      ('b06832e9-e141-438d-83d8-0d1b112d6243', '土田　直矢', 'ツチダ　ナオヤ', NULL, 'admin-manual-import', '2026-02-16 10:18:47.119045', '2026-02-16 10:18:47.119045'),
      ('d62cfa48-664f-4ff2-a276-96842e88c91b', 'テストスタッフ', 'テストスタッフ', NULL, 'admin-manual-import', '2026-02-16 10:19:00.258494', '2026-02-16 10:19:00.258494'),
      ('c4882bde-8fa0-425a-b29e-45a63af1cfc5', '中嶋　正一', 'ナカジマ　ショウイチ', NULL, 'admin-manual-import', '2026-02-16 10:18:58.851201', '2026-02-16 10:18:58.851201'),
      ('03f26cec-e969-47d3-bf89-2e064a2abdce', '中田　琉月', 'ナカタ　ルツキ', NULL, 'admin-manual-import', '2026-02-16 10:18:49.055846', '2026-02-16 10:18:49.055846'),
      ('bca398ac-c11e-424c-b098-cb498b09abb0', '中村　文彦', 'ナカムラ　フミヒコ', NULL, 'admin-manual-import', '2026-02-16 10:18:49.989084', '2026-02-16 10:18:49.989084'),
      ('461239ac-ba19-4896-82bd-44587a46c443', '西村　克人', 'ニシムラ カツト', NULL, 'admin-manual-import', '2026-02-16 10:18:52.749628', '2026-02-16 10:18:52.749628'),
      ('f5321299-9b72-4b51-890d-4a311d57efeb', '波多野　匠', 'ハタノタクミ', NULL, 'admin-manual-import', '2026-02-16 10:18:50.457041', '2026-02-16 10:18:50.457041'),
      ('1527734d-a112-4176-8bc7-63169bd14e1c', '廣中　良信', 'ヒロナカ　ヨシノブ', NULL, 'admin-manual-import', '2026-02-16 10:18:47.627824', '2026-02-16 10:18:47.627824'),
      ('34e86a31-9c7b-48fa-b36b-24128dd76327', '藤井　勝', 'フジイ　マサル', NULL, 'admin-manual-import', '2026-02-16 10:18:55.098616', '2026-02-16 10:18:55.098616'),
      ('bfaef3bc-2eb8-4a8b-9437-b200ff643b75', '藤田　風雅', 'フジタ　フウガ', NULL, 'admin-manual-import', '2026-02-16 10:18:48.110747', '2026-02-16 10:18:48.110747'),
      ('2969c9f2-b58b-4c37-bde2-f13e7c3642a7', '松本　祐太郎', 'マツモト ユウタロウ', NULL, 'admin-manual-import', '2026-02-16 10:18:52.298822', '2026-02-16 10:18:52.298822'),
      ('a7f96a6a-907e-45b5-a1eb-462f95ccf57c', '峯　栄治', 'ミネ　エイジ', NULL, 'admin-manual-import', '2026-02-16 10:18:53.686006', '2026-02-16 10:18:53.686006'),
      ('439a9918-4006-4fe7-b21f-94192a0144e1', '宮﨑　萌', 'ミヤザキ　モエ', NULL, 'admin-manual-import', '2026-02-16 10:18:51.376873', '2026-02-16 10:18:51.376873')
    ON CONFLICT (id) DO NOTHING
  `);
};

exports.down = async (pgm) => {
  pgm.sql(`
    DELETE FROM staff_master
    WHERE created_by = 'admin-manual-import'
      AND id IN (
        'e2a3ee29-fa62-4394-b5c5-4826f30cde30', '49972e7a-f311-4358-86cb-2b5c34081b69',
        '433360cd-5de2-4402-83a4-1c0abb2f1626', '2018528a-1287-4df3-9401-14b88fceaf6d',
        '5cdb75da-9c58-4dbf-9deb-195afdc96fd1', '0f1514c9-0524-4be6-b725-5161ed6a371f',
        '578c67f0-88e9-4f2d-93b1-079d977b71ca', '712606ff-a3bd-49ae-a351-9cd10dab8bb5',
        '83b466ae-a722-4238-b698-8bc93f99a5f7', 'b55cd8f2-2e28-4f84-bb79-084107001b13',
        'e9bc1be3-8661-4456-ad1e-9618ccf01abf', 'ed998da1-091c-4d1a-94f7-22ed6376beb7',
        '897b046a-15fc-4865-af3f-f5d2f1d4671d', '105b5ece-354d-4376-b56b-d0dbbafcd1e3',
        '85580fdd-feb4-495b-a2ae-5b7f3928cc96', '15dd404b-8f6e-40ca-8f81-cd19549cc78b',
        'b06832e9-e141-438d-83d8-0d1b112d6243', 'd62cfa48-664f-4ff2-a276-96842e88c91b',
        'c4882bde-8fa0-425a-b29e-45a63af1cfc5', '03f26cec-e969-47d3-bf89-2e064a2abdce',
        'bca398ac-c11e-424c-b098-cb498b09abb0', '461239ac-ba19-4896-82bd-44587a46c443',
        'f5321299-9b72-4b51-890d-4a311d57efeb', '1527734d-a112-4176-8bc7-63169bd14e1c',
        '34e86a31-9c7b-48fa-b36b-24128dd76327', 'bfaef3bc-2eb8-4a8b-9437-b200ff643b75',
        '2969c9f2-b58b-4c37-bde2-f13e7c3642a7', 'a7f96a6a-907e-45b5-a1eb-462f95ccf57c',
        '439a9918-4006-4fe7-b21f-94192a0144e1'
      )
  `);
};
